app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Potions"], ["room_number", 404], ["created_at", "2021-01-14 23:13:52.825821"], ["updated_at", "2021-01-14 23:13:52.825821"]]
---
  def create
    @school_class = SchoolClass.create(school_class_params(:title, :room_number))

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "school_classes" SET "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["room_number", 2], ["updated_at", "2021-01-15 02:52:57.596160"], ["id", 3]]
---
  def update
    @school_class = SchoolClass.find(params[:id])
    @school_class.update(school_class_params(:title, :room_number))