app/controllers/students_controller.rb

  def create
    student = Student.create(student_params(:first_name, :last_name))
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Michael"], ["last_name", "Cardona"], ["created_at", "2021-01-14 20:34:57.421133"], ["updated_at", "2021-01-14 20:34:57.421133"]]

  def update
    @student = Student.find(params[:id])
    @student.update(student_params(:first_name, :last_name))
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "students" SET "first_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Mike"], ["updated_at", "2021-01-14 21:18:47.801965"], ["id", 1]]